docs/aggregator.puml
@startuml
' The following is generated by gen_component_diagram, all changes will be lost.
left to right direction
skinparam linetype ortho

frame sources {
    component source_file_json
    component source_file_json_in_json
    component source_internal_logs
}

frame transforms {
    component transform_final
    component transform_hook_post_json_parsing
    component transform_hook_pre_postprocess
    component transform_int_source_enrich_internal_logs
    component transform_module_checkmk
    component transform_module_opnsense
    component transform_module_other
    component transform_module_vector
    component transform_module_vmware
    component transform_postprocess
    component transform_postprocess_all
    component transform_pre_ingest_pipeline_module_xxx
    component transform_prepare_event_metadata
    component transform_preprocessors_last
    component transform_route_to_module
    component transform_route_to_module._unmatched
    component transform_route_to_module.checkmk
    component transform_route_to_module.opnsense
    component transform_route_to_module.vector
    component transform_route_to_module.vmware
    component transform_route_to_module.xxx
    component transform_route_to_sink
    component transform_route_to_sink.ingest_default
    component transform_route_to_sink.ingest_xxx
    component transform_source_enrich_file_json
    component transform_source_enrich_file_json_in_json
    component transform_source_enrich_internal_logs
}

frame sinks {
    component sink_elasticsearch_logging_cluster
    component sink_elasticsearch_logging_cluster_ingest_xxx
    component sink_file_local
}

sources -[hidden]-> transforms
transforms -[hidden]-> sinks

source_file_json -> transform_source_enrich_file_json
source_file_json_in_json -> transform_source_enrich_file_json_in_json
transform_int_source_enrich_internal_logs -> transform_source_enrich_internal_logs
transform_final -> transform_route_to_sink
source_internal_logs -> transform_int_source_enrich_internal_logs
transform_source_enrich_file_json -> transform_prepare_event_metadata
transform_source_enrich_file_json_in_json -> transform_prepare_event_metadata
transform_source_enrich_internal_logs -> transform_prepare_event_metadata
transform_hook_post_json_parsing -> transform_preprocessors_last
transform_hook_pre_postprocess -> transform_postprocess
transform_postprocess -> transform_postprocess_all
transform_route_to_module.checkmk -> transform_module_checkmk
transform_route_to_module.opnsense -> transform_module_opnsense
transform_route_to_module._unmatched -> transform_module_other
transform_route_to_module.vector -> transform_module_vector
transform_route_to_module.vmware -> transform_module_vmware
transform_route_to_module.xxx -> transform_pre_ingest_pipeline_module_xxx
transform_prepare_event_metadata -> transform_hook_post_json_parsing
transform_preprocessors_last -> transform_route_to_module
transform_module_checkmk -> transform_hook_pre_postprocess
transform_module_opnsense -> transform_hook_pre_postprocess
transform_module_other -> transform_hook_pre_postprocess
transform_module_vector -> transform_hook_pre_postprocess
transform_module_vmware -> transform_hook_pre_postprocess
transform_postprocess_all -> transform_final
transform_route_to_sink.ingest_default -> sink_elasticsearch_logging_cluster
transform_route_to_sink.ingest_xxx -> sink_elasticsearch_logging_cluster_ingest_xxx
transform_int_source_enrich_internal_logs -> sink_file_local

@enduml
